In [ ]:
!pip install pandas

In [2]:
import pandas as pd
name_of_companies = ["Fusemachines","NIC","Info","Leapfrog"]
names = pd.Series(name_of_companies)
names

0    Fusemachines
1             NIC
2            Info
3        Leapfrog
dtype: object

In [3]:
names.values

array(['Fusemachines', 'NIC', 'Info', 'Leapfrog'], dtype=object)

In [4]:
names.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data = pd.Series([5,10,15,20],index = ['a','b','c','d'])

In [6]:
data

a     5
b    10
c    15
d    20
dtype: int64

In [7]:
data[0]

5

In [9]:
data[0:2]

a     5
b    10
dtype: int64

In [10]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [13]:
df["Comapanies"] = names

In [14]:
df

     Comapanies
0  Fusemachines
1           NIC
2          Info
3      Leapfrog

In [15]:
name_of_companies = ["Fusemachines","NIC","Info","Leapfrog"]
location = ["Baneshwor","Balkhu","NIC","Tangal"]
salary = [20000,30000,40000,50000]
info_dict = {"Company_name":name_of_companies,"location":location,"Salary":salary}

df = pd.DataFrame(data=info_dict)
df

   Company_name   location  Salary
0  Fusemachines  Baneshwor   20000
1           NIC     Balkhu   30000
2          Info        NIC   40000
3      Leapfrog     Tangal   50000

In [29]:
df.set_index("Company_name",inplace=True)

In [30]:
df

               location  Salary
Company_name
Fusemachines  Baneshwor   20000
NIC              Balkhu   30000
Info                NIC   40000
Leapfrog         Tangal   50000

In [33]:
df.loc[["Info","NIC"]]

             location  Salary
Company_name
Info              NIC   40000
NIC            Balkhu   30000

In [36]:
df.iloc[[1,2]]

             location  Salary
Company_name
NIC            Balkhu   30000
Info              NIC   40000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Company_name  4 non-null      object
 1   location      4 non-null      object
 2   Salary        4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [18]:
df.describe()

             Salary
count      4.000000
mean   35000.000000
std    12909.944487
min    20000.000000
25%    27500.000000
50%    35000.000000
75%    42500.000000
max    50000.000000

In [19]:
bundesliga_video_data_df = pd.read_csv("/home/fm-pc-lt-228/Desktop/dfl_bundesliga_data/train.csv")

In [20]:
bundesliga_video_data_df

         video_id         time      event           event_attributes
0      1606b0e6_0   200.265822      start                        NaN
1      1606b0e6_0   201.150000  challenge     ['ball_action_forced']
2      1606b0e6_0   202.765822        end                        NaN
3      1606b0e6_0   210.124111      start                        NaN
4      1606b0e6_0   210.870000  challenge  ['opponent_dispossessed']
...           ...          ...        ...                        ...
11213  ecf251d4_0  3056.587000  challenge  ['opponent_dispossessed']
11214  ecf251d4_0  3058.072895        end                        NaN
11215  ecf251d4_0  3068.280519      start                        NaN
11216  ecf251d4_0  3069.547000    throwin                   ['pass']
11217  ecf251d4_0  3070.780519        end                        NaN

[11218 rows x 4 columns]

In [21]:
bundesliga_video_data_df["event"]

0            start
1        challenge
2              end
3            start
4        challenge
           ...
11213    challenge
11214          end
11215        start
11216      throwin
11217          end
Name: event, Length: 11218, dtype: object

In [22]:
bundesliga_video_data_df[1:5]

     video_id        time      event           event_attributes
1  1606b0e6_0  201.150000  challenge     ['ball_action_forced']
2  1606b0e6_0  202.765822        end                        NaN
3  1606b0e6_0  210.124111      start                        NaN
4  1606b0e6_0  210.870000  challenge  ['opponent_dispossessed']

# loc vs iloc